In [10]:
import pandas as pd
import numpy as np

''' pandas의 데이터 기본 유닛 Series '''
s = pd.Series([1,3,5,np.nan,6,8]) # 항상! 하나의 클래스의 메소드라는 걸 잊지 말자
                                  # (인자 = 리스트)
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [11]:
''' 날짜형 데이터 '''
dates = pd.date_range('20130101',periods = 6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [53]:
''' DATA FRAME '''
''' np.random.rand(m,n): 평균 0, 표준편차 1의 표준정규분포 난수를 martix array(m,n) 생성 '''
df = pd.DataFrame(np.random.randn(6,4),
                 index = dates,
                 columns = ['A',"B","C","D"])
df

                   A         B         C         D
2013-01-01  0.182333  0.745556  0.415064  1.136823
2013-01-02  1.485959  0.944716 -0.377520 -0.905170
2013-01-03  0.371431 -0.772824 -1.476739  1.357251
2013-01-04  0.308085 -0.746355 -1.880493 -0.422035
2013-01-05 -0.258047  0.610480 -0.261842  1.742788
2013-01-06  0.051111  1.109177 -0.755445 -0.170412

In [16]:
print(df.index)
print(df.columns)
df.values # array 형태로 나오죠?

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')
Index(['A', 'B', 'C', 'D'], dtype='object')

array([[-0.20254721, -1.59067548, -0.24794105, -2.19442494],
       [ 1.33015773, -1.20445432, -1.14831591, -0.88315052],
       [-0.44848274,  0.59698022, -2.16549298, -0.05142072],
       [-1.47111787, -0.56669454,  0.14636838,  0.39551041],
       [-0.4239815 ,  0.0404399 ,  1.62876491,  0.47367144],
       [ 0.60894386,  0.10185615,  2.04839982,  1.11143948]])

In [39]:
''' info 명령으로 해당 데이터의 개요를 알기 '''
df.info()

''' describe는 통계적 개요 '''
df.describe()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
dtypes: float64(4)
memory usage: 368.0 bytes

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.101171 -0.437091  0.043631 -0.191396
std    0.965902  0.839548  1.607998  1.182742
min   -1.471118 -1.590675 -2.165493 -2.194425
25%   -0.442357 -1.045014 -0.923222 -0.675218
50%   -0.313264 -0.263127 -0.050786  0.172045
75%    0.406071  0.086502  1.258166  0.454131
max    1.330158  0.596980  2.048400  1.111439

In [19]:
''' sort_values(by = '지정된 컬럼을 기준으로 정렬', ascending = True / False) '''
df.sort_values(by="B",ascending = True)

                   A         B         C         D
2013-01-01 -0.202547 -1.590675 -0.247941 -2.194425
2013-01-02  1.330158 -1.204454 -1.148316 -0.883151
2013-01-04 -1.471118 -0.566695  0.146368  0.395510
2013-01-05 -0.423982  0.040440  1.628765  0.473671
2013-01-06  0.608944  0.101856  2.048400  1.111439
2013-01-03 -0.448483  0.596980 -2.165493 -0.051421

In [41]:
''' df['A'] 하면 해당 컬럼만 Series로 보여줍니다'''
print(df['A'])

''' 행만 선택해서 보고싶다? 그러면 df[::]'''
print(df[::-1])
print(df[0:3])
df['20130102':'20130103']

2013-01-01   -0.202547
2013-01-02    1.330158
2013-01-03   -0.448483
2013-01-04   -1.471118
2013-01-05   -0.423982
2013-01-06    0.608944
Freq: D, Name: A, dtype: float64
                   A         B         C         D
2013-01-06  0.608944  0.101856  2.048400  1.111439
2013-01-05 -0.423982  0.040440  1.628765  0.473671
2013-01-04 -1.471118 -0.566695  0.146368  0.395510
2013-01-03 -0.448483  0.596980 -2.165493 -0.051421
2013-01-02  1.330158 -1.204454 -1.148316 -0.883151
2013-01-01 -0.202547 -1.590675 -0.247941 -2.194425
                   A         B         C         D
2013-01-01 -0.202547 -1.590675 -0.247941 -2.194425
2013-01-02  1.330158 -1.204454 -1.148316 -0.883151
2013-01-03 -0.448483  0.596980 -2.165493 -0.051421

                   A         B         C         D
2013-01-02  1.330158 -1.204454 -1.148316 -0.883151
2013-01-03 -0.448483  0.596980 -2.165493 -0.051421

In [38]:
''' loc(location)옵션으로 변수에서 인덱싱도 가능하다 '''
print(df.loc[dates[0]])
print(df.loc[:,["A","B"]]) # 선택한 열만 뽑는다
df.loc[dates[0:2],['A',"B"]] # 행,렬을 둘 다 지정할 수도 있다.

A   -0.202547
B   -1.590675
C   -0.247941
D   -2.194425
Name: 2013-01-01 00:00:00, dtype: float64
                   A         B
2013-01-01 -0.202547 -1.590675
2013-01-02  1.330158 -1.204454
2013-01-03 -0.448483  0.596980
2013-01-04 -1.471118 -0.566695
2013-01-05 -0.423982  0.040440
2013-01-06  0.608944  0.101856

                   A         B
2013-01-01 -0.202547 -1.590675
2013-01-02  1.330158 -1.204454

In [36]:
''' df.iloc
이렇게 말고 그냥 숫자로 하는 게 더 편하겠지? '''
print(df.iloc[0:3,2:4])
print(df.iloc[[1,2,4],[0,2]])
df.iloc[[1,2,3],:]

                   C         D
2013-01-01 -0.247941 -2.194425
2013-01-02 -1.148316 -0.883151
2013-01-03 -2.165493 -0.051421
                   A         C
2013-01-02  1.330158 -1.148316
2013-01-03 -0.448483 -2.165493
2013-01-05 -0.423982  1.628765

                   A         B         C         D
2013-01-02  1.330158 -1.204454 -1.148316 -0.883151
2013-01-03 -0.448483  0.596980 -2.165493 -0.051421
2013-01-04 -1.471118 -0.566695  0.146368  0.395510

In [35]:
''' filter 함수처럼 특정 조건만 거르는 체 '''
print(df[df["A"]>0])
df[df>0] # 데이터 전체에서 조건을 걸면 만족하지 않는 곳은 NaN이라고 뜹니다.

                   A         B         C         D
2013-01-02  1.330158 -1.204454 -1.148316 -0.883151
2013-01-06  0.608944  0.101856  2.048400  1.111439

                   A         B         C         D
2013-01-01       NaN       NaN       NaN       NaN
2013-01-02  1.330158       NaN       NaN       NaN
2013-01-03       NaN  0.596980       NaN       NaN
2013-01-04       NaN       NaN  0.146368  0.395510
2013-01-05       NaN  0.040440  1.628765  0.473671
2013-01-06  0.608944  0.101856  2.048400  1.111439

In [56]:
''' DataFrame의 복사 
df2 = df 라고 쓰면 df도 df2랑 따라가서, df를 보존하고 싶으면
df2 = df.copy() 라고 해야 함
'''
df2 = df.copy()
df2['E'] = [
    'one',
    'two',
    'three',
    'four',
    'five',
    'six'
]

print(df)
df2

                   A         B         C         D
2013-01-01  0.182333  0.745556  0.415064  1.136823
2013-01-02  1.485959  0.944716 -0.377520 -0.905170
2013-01-03  0.371431 -0.772824 -1.476739  1.357251
2013-01-04  0.308085 -0.746355 -1.880493 -0.422035
2013-01-05 -0.258047  0.610480 -0.261842  1.742788
2013-01-06  0.051111  1.109177 -0.755445 -0.170412

                   A         B         C         D      E
2013-01-01  0.182333  0.745556  0.415064  1.136823    one
2013-01-02  1.485959  0.944716 -0.377520 -0.905170    two
2013-01-03  0.371431 -0.772824 -1.476739  1.357251  three
2013-01-04  0.308085 -0.746355 -1.880493 -0.422035   four
2013-01-05 -0.258047  0.610480 -0.261842  1.742788   five
2013-01-06  0.051111  1.109177 -0.755445 -0.170412    six

In [65]:
''' isIn 으로 True, False 넣어있는지 봅시다 '''
print(df2['E'].isin(['two','four'])) # 책에 있는 isIn은 오타에요!
''' 이 값은 True/False로 나오겠지? 그러면 R에서 했던 것처럼 True만 나오도록 만들 수도 있겠죠? 
'''
df2[df2['E'].isin(['two','four'])]

2013-01-01    False
2013-01-02     True
2013-01-03    False
2013-01-04     True
2013-01-05    False
2013-01-06    False
Freq: D, Name: E, dtype: bool

                   A         B         C         D     E
2013-01-02  1.485959  0.944716 -0.377520 -0.905170   two
2013-01-04  0.308085 -0.746355 -1.880493 -0.422035  four

In [67]:
''' apply 함수 - R에서 했었지? 행끼리 결과를 만들어내는 함수 '''
print(df.apply(np.cumsum)) # 누적합. cumulative sum
df.apply(lambda x: max(x) - min(x))

                   A         B         C         D
2013-01-01  0.182333  0.745556  0.415064  1.136823
2013-01-02  1.668293  1.690272  0.037544  0.231653
2013-01-03  2.039723  0.917449 -1.439195  1.588903
2013-01-04  2.347809  0.171093 -3.319687  1.166868
2013-01-05  2.089761  0.781573 -3.581530  2.909656
2013-01-06  2.140872  1.890751 -4.336975  2.739244

A    1.744007
B    1.882001
C    2.295557
D    2.647958
dtype: float64